Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.CenterPoint Property
 The center point of the grid label.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point CenterPoint { get; }
Public ReadOnly Property CenterPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace